import React from 'react';
import {Link} from "react-router-dom";
import {LocalPhoneRounded, MailRounded} from '@mui/icons-material/';

import './footer.scss';

const Footer = () => {
    return (
        <footer>
            <div className="container">
                <div className="border"></div>
                <div className="footer-inner">
                    <div className="footer-item">
                        <h4 className="middle-title">Категории</h4>
                        <Link to="/products/man" className='blue-hover'>Мужское</Link>
                        <Link to="/products/woman" className='blue-hover'>Женское</Link>
                        <Link to="/products/unisex" className='blue-hover'>Унисекс</Link>
                    </div>
                    <div className="footer-item">
                        <h4 className="middle-title">О нас</h4>
                        <Link to="./about-company" className='blue-hover'>О компании</Link>
                        <a href="#" className='blue-hover'>Контакты</a>
                        <a href="#" className='blue-hover'>FAQ</a>
                    </div>
                    <div className="footer-item">
                        <h4 className="middle-title">Свяжитесь с нами</h4>
                        <a href="tel:+998971777030" className="blue-hover"><LocalPhoneRounded/>+998971777030</a>
                        <a href="mailto:mhoja9494@gmail.com" className='blue-hover'><MailRounded/>mhoja9494@gmail.com</a>
                        <div style={{display: 'flex', gap: 10}}>
                            <a href="https://t.me/magalutfullaev">
                                <svg xmlns="http://www.w3.org/2000/svg"
                                     version="1.1"
                                     viewBox="0 0 512 512"><g id="_x33_35-telegram"><g><g><path d="M484.689,98.231l-69.417,327.37c-5.237,23.105-18.895,28.854-38.304,17.972L271.2,365.631     l-51.034,49.086c-5.646,5.647-10.371,10.372-21.256,10.372l7.598-107.722L402.539,140.23c8.523-7.598-1.848-11.809-13.247-4.21     L146.95,288.614L42.619,255.96c-22.694-7.086-23.104-22.695,4.723-33.579L455.423,65.166     C474.316,58.081,490.85,69.375,484.689,98.231z"/></g></g></g>
                                    <g id="Layer_1"/>
                                </svg>
                            </a>
                            <a href="https://t.me/magalutfullaev">
                                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
                                    <path
                                        d="M256,49.471c67.266,0,75.233.257,101.8,1.469,24.562,1.121,37.9,5.224,46.778,8.674a78.052,78.052,0,0,1,28.966,18.845,78.052,78.052,0,0,1,18.845,28.966c3.45,8.877,7.554,22.216,8.674,46.778,1.212,26.565,1.469,34.532,1.469,101.8s-0.257,75.233-1.469,101.8c-1.121,24.562-5.225,37.9-8.674,46.778a83.427,83.427,0,0,1-47.811,47.811c-8.877,3.45-22.216,7.554-46.778,8.674-26.56,1.212-34.527,1.469-101.8,1.469s-75.237-.257-101.8-1.469c-24.562-1.121-37.9-5.225-46.778-8.674a78.051,78.051,0,0,1-28.966-18.845,78.053,78.053,0,0,1-18.845-28.966c-3.45-8.877-7.554-22.216-8.674-46.778-1.212-26.564-1.469-34.532-1.469-101.8s0.257-75.233,1.469-101.8c1.121-24.562,5.224-37.9,8.674-46.778A78.052,78.052,0,0,1,78.458,78.458a78.053,78.053,0,0,1,28.966-18.845c8.877-3.45,22.216-7.554,46.778-8.674,26.565-1.212,34.532-1.469,101.8-1.469m0-45.391c-68.418,0-77,.29-103.866,1.516-26.815,1.224-45.127,5.482-61.151,11.71a123.488,123.488,0,0,0-44.62,29.057A123.488,123.488,0,0,0,17.3,90.982C11.077,107.007,6.819,125.319,5.6,152.134,4.369,179,4.079,187.582,4.079,256S4.369,333,5.6,359.866c1.224,26.815,5.482,45.127,11.71,61.151a123.489,123.489,0,0,0,29.057,44.62,123.486,123.486,0,0,0,44.62,29.057c16.025,6.228,34.337,10.486,61.151,11.71,26.87,1.226,35.449,1.516,103.866,1.516s77-.29,103.866-1.516c26.815-1.224,45.127-5.482,61.151-11.71a128.817,128.817,0,0,0,73.677-73.677c6.228-16.025,10.486-34.337,11.71-61.151,1.226-26.87,1.516-35.449,1.516-103.866s-0.29-77-1.516-103.866c-1.224-26.815-5.482-45.127-11.71-61.151a123.486,123.486,0,0,0-29.057-44.62A123.487,123.487,0,0,0,421.018,17.3C404.993,11.077,386.681,6.819,359.866,5.6,333,4.369,324.418,4.079,256,4.079h0Z"/>
                                    <path
                                        d="M256,126.635A129.365,129.365,0,1,0,385.365,256,129.365,129.365,0,0,0,256,126.635Zm0,213.338A83.973,83.973,0,1,1,339.974,256,83.974,83.974,0,0,1,256,339.973Z"/>
                                    <circle cx="390.476" cy="121.524" r="30.23"/>
                                </svg>
                            </a>
                        </div>
                    </div>
                </div>
                <div className="border"></div>
                <div className="footer-bottom">
                    <p className='subtitle'><Link to="./user-agreement">Пользовательское соглашение</Link> и <Link to="./privacy-policy">политика конфиденциальности</Link></p>
                    <p className="subtitle">©CLOZA 2021. Все права защищены</p>
                </div>
            </div>
        </footer>
    );
};

export default Footer;